
*** What is functional programming
Functional programming is both a style of programming and a set of language features designed to make functional programs natural to write and performant. That style revolves around two novel notions of what a function is. First, functions in a functional programming language are analogous to functions in math - relationships between inputs in a domain and return values in a range; they are guaranteed to return the same result from the same inputs. Second, functions are themselves 'normal values' - they can be passed as arguments to other functions, or returned from other functions as return values.

Languages like c allow a programmer to use functions in this way but do not make it easy. C is modeled closely on computer hardware, a context that emphasizes allocating memory and manipulating it. These operations are not 'functional' in the mathematical sense, because they involve 'doing' things - fetching memory blocks, performing some activity that is dependent on what was found in the memory block, and modifying the memory block. Functions in math are relationships between values in a domain and a range; these relationships are not dependent on the state of things like memory blocks, and the evaluation of a function's result in math does not impact the world in a way that changes other mathematical equations.

More natural support for functional programming is available in many higher-level languages, for instance python has the builtin functions $map$, which takes a function and a list and returns a list with the function applied to each element. We can write a function that modifies a single number and apply that function to a list of numbers using $map$.

\singlespacing

#+NAME: pythonMap
#+BEGIN_SRC python :results output
  def topLimit(x):
      if x > 10:
          return 10
      else:
          return x

  print map(topLimit,[1,15,20,3,-2,5])
#+END_SRC
#+RESULTS: pythonMap
: [1, 10, 10, 3, -2, 5]

\doublespacing

The $map$ function in Haskell looks very similar, except that there are no parentheses used in applying a function to its arguments. The first line defines the function $topLimit$ as a mapping from number to number, and the second line uses $map$ to apply $topLimit$ to a list of numbers.

\singlespacing

#+NAME: haskellMap 
#+BEGIN_SRC haskell :tangle tangles/haskellMap.hs
module Main where

  topLimit x
    | x > 10    = 10 
    | otherwise = x  

  main = print( map topLimit [1,15,20,3,-2,2] )
#+END_SRC

#+BEGIN_SRC sh :results output :exports results
runhaskell tangles/haskellMap.hs
#+END_SRC

#+RESULTS:
[1   | 10 | 10 | 3 | -2 | 2]


\doublespacing

*** Declarative programming

Another side of the story of how Haskell facilitates writing code with fewer bugs is /immutability/ - the notion that variables are fixed at a single value throughout a program. The rationalle is that the behavior of a program is much harder to reason about when variables are allowed to change value. All modern languages have facilities for limiting the access of particular variables to specific other regions in the source code, to make this reasoning easier. Haskell goes to the extreme by forbiding any variable from changing.

Removing the ability to change a variable is obviously an enormous restriction on the flexability and usefullness of a language, and it's not immediately clear how many types of programs we could recover in this regime. In fact, this aspect of Haskell was very unflattering during its early history [TODO - lazy with class]. But a great deal of research and practice have resulted in new programming tools, styles and idioms that bridge the gap. After importing something called a /monad/ from abstract mathematics, the notion of change could be integrated into the type system in a highly principled way [TODO Wadler], and now Haskell is an exceptionally good language for coordinating programs with moving parts and uncertainty from the data in the world.

But before resorting to monads, it is usefull to see how many values can be computed without making use of changing variables, using pure mathematical equations instead.

\singlespacing

#+BEGIN_SRC haskell
length :: [a]    -> Int
length    []     =  0
length    (x:xs) =  1 + length xs
#+END_SRC

\doublespacing

In this listing, the function $length$ is defined by parts. The length of the empty list ( [] ) is $0$. The length of any list that can be broken into its first element and a remainder is $1$ more than the length of the remainder. Evaluating the right-hand-side in the non-empty-list case involves a recursive call to length on $xs$. The term $(x:xs)$ on the left-hand side is a way of naming different parts of the input value passed to the function that makes this kind of recursive definition (the definition of functions in general) convenient. These names only apply within the body of the function, they aren't permanently stored or passed into subfunctions. So when we recursively descend into length, the name $xs$ is a different variable in each context, respectively being bound to a smaller sublist. This is easier to see with the names removed completely:

\singlespacing

#+BEGIN_SRC haskell
  length "Rat"           -- matches (R:"at")
= 1 + length "at"        -- matches (a:"t")
= 1 + 1 + length "t"     -- matches (t: [])
= 1 + 1 + 1 + length []  -- matches []
= 1 + 1 + 1 + 0
= 3
#+END_SRC

\doublespacing

Using recursion, we described the length of the list, rather than computing it with iteration as we would in Python:

\singlespacing

#+BEGIN_SRC python :results output :exports both
def listLength(x):
    nElem = 0
    for i in x:
        nElem = nElem + 1
    return nElem 

print listLength('Hello iteration.')
#+END_SRC

#+RESULTS:
: 16

\doublespacing

The differences between declarative and traditional styles becomes more clear when we combine pieces together into larger programs. Let's try to take the product of the first 10 elemnts of the Fibbonacci sequence.

\singlespacing

#+BEGIN_SRC python :results output :exports both
def listProduct(xs):
    acc = 1
    for n in xs:
        acc = acc * n;
    return acc

def makeFibbonacci(nElems):
    fibs = [1,1]
    for n in range(2,nElems):
        fibs.insert(n,fibs[n-1] + fibs[n-2])
    return fibs

print listProduct(makeFibbonacci(10))

#+END_SRC

#+RESULTS:
: 122522400

\doublespacing

This works, but it's a little unsatisfying to have to say how to build an array filled with Fibbonacci numbers, instead of describing the series itself, and that the definition is tangled up with an arbitrary detail, the length of the list we want to produce. What would happen if we needed the $1000000000$th number, and the array didn't fit it memory? Should we have used something more complicated like a generator, to produce Fibbonacci numbers without using increasing amounts of memory? This would force any users of $makeFibbonacci$ to consume streams. In Haskell, we use recursion to declare what Fibbonacci numbers are:

\singlespacing

#+BEGIN_SRC haskell :tangle tangles/fib.hs
fibs :: [Integer]
fibs = [1,1] ++ (zipWith (+) fibs (tail fibs))
#+END_SRC

\doublespacing

Translating this into English, $fibs$ is the list [1,1] followed by the list-wise sum of $fibs$ with $fibs$ less its first element. The surprising fact that we can define a value in terms of itself comes from the fact that, in math, we don't need to know the entire list $fibs$ in order to apply a function to $fibs$, we only need to know enough about $fibs$ to satisfy what will be used by the function. Here $fibs$ is defined as a seed and a function that only needs the seed in order to produce the next value. But this is an implementation detail. From the point of view of the programmer, we have our hands on a value $fibs$ that is indistinguiquasble from the entire infinite series. Trying to take the product of the list will take infinite time, not because our definition is infinite, but because we are doing something infinite. On the other hand, we can do something finite with something infinite, and it will take only finite time.

\singlespacing

#+BEGIN_SRC haskell :tangle tangles/fibprod.hs
module Main where

fibs = [1,1] ++ (zipWith (+) fibs (tail fibs))
prodFibs n = product (take n fibs)
main = print(prodFibs 10)
#+END_SRC

#+BEGIN_SRC sh :results output :exports results
runhaskell tangles/fibprod.hs
#+END_SRC

#+RESULTS:
: 122522400

\doublespacing

This property of being able to apply functions to arguments when the arguments aren't fully known is called $laziness$, and it is one of the main features allowing declarative programming style and the combination of diverse software components into large programs. Combining infinite things with other infinite things in finite time, and decoupling mathematical models from details about how many elements to generate, are central to that. For an excellent discussion of functional programming's role as a glue layer between large components see Why Functional Programming Matters [@hughes1989functional].


*** Concurrency - difficulty of running multiple threads simultaneously
Concurrency is the simultaneous executition of multiple sections of code simultaneously [fn:: or interleaved in time with one another quickly enough that they appear to be executing simultaneously]. The Haskell standard library provides the function $forkIO$, which takes as its input a single action to run and acquires a new thread from the Haskell runtime to run that action.

\singlespacing

#+NAME: forkIO
#+BEGIN_SRC haskell :tangle tangle/forkIOExample.hs
module Main where
import Control.Concurrent
import Control.Monad

action :: [Char] -> IO ()
action xs = 
  forM_ xs (flip (>>) (threadDelay 500000) . putChar)

main = do
  forkIO $ action ['a'..'e']
  action ['v'..'z']
#+END_SRC

#+RESULTS:
>> avwbxcydze

\doublespacing

Our $action$ function takes a list of characters and slowly prints them. In $main$, we send one action applied to the list $['a'..'e']$ to a separate thread, and run the same action applied to a different list on the main thread. Because these actions are running concurrently we see the letters mixed with one another in the output (if we remove the $forkIO$, we would have seen 'abcdevwxyz' because the two actions run squentially).

The fact that 'w' appears before 'b' is surpsing, since we expected that 'a' appearing before 'v' implied that the first action's effects will happen before the second action's. In fact we have requested that the letters from the respective lists be printed approximately at the same time; the exact ordering depends on tiny fluctuations in the timing of threads in the runtime system. Running this progam repeatedly, 'b' does come before 'w', about half of the time. When the output of a concurrent program is noticeably different in circumstances that are not noticeably different, this is called a 'race condition' [@bernstein1966analysis]. The metaphor is that two threads are racing toward two positions in memory; the first one will write into the first slot and the second will will write into the second slot.

Does it matter whether 'b' or 'w' is printed first? The answer depends on the application. Even in moderately complex programs, predicting the locations of race conditions can be unintuitive and failing to notice them can result in corrupted data or a disruption of the forward flow of the program. In one famous case, a race condition among three power-line sensors lead to a failure of the alarm system at FirstEnergy Corp, preventing a response as snow-covered trees damaged a number of cables, [fn::  The report tells in fascinating detail just how hard routing out this kind of bug can be: ``The bug had a window of opportunity measured in milliseconds. 'There was a couple of processes that were in contention for a common data structure, and through a software coding error in one of the application processes, they were both able to get write access to a data structure at the same time,' says Unum. `And that corruption led to the alarm event application getting into an infinite loop and spinning ... This fault was so deeply embedded, it took them weeks of poring through millions of lines of code and data to find it.'"] and leading to a 2-day blackout for 8 million Canadians and midwesterners[@poulsen2004tracking].

As a rule of thumb, race conditions become problematic when mulitple threads share read and write access to common data, and some multi-step operations on that data only make sense if the operations are carried out without interruption. The classic example is an a pair of banks processing the transfer of money between ``Alice" and ``Bob" who live in two different states. In this case two different computers in two different banks need to access shared data: the balance of Alice's account and the balance of Bob's account. This pseudocode does the job:

\singlespacing

#+NAME: bankExample 
#+BEGIN_SRC haskell
module Bank.Transfer where

transfer :: IORef Account -> IORef Account -> DollarAmount -> IO ()
transfer fromAccount tAccount amount = do
  a <- readIORef fromAccount
  writeIORef fromAccount (a - amount)
  b <- readIORef toAccount
  writeIORef toAccount (b + amount)
#+END_SRC

\doublespacing

The $IORef Account$ type is a reference to a value that can be shared across threads. $transfer$ takes two references and an amount to transfer. It then reads the balances and increments each to reflect the money transfer. This works as long as Alice and Bob aren't at the bank at the same time. But if they try to send each other money at nearly the same time, this unfortunate sequence of events could happen:

#+CAPTION: \textbf{A race condition can corrupt data.} Two concurrent threads operating on shared data will often lead to a corrupted final state, because the individual steps in each operation change the shared data in ways not accounted for by the other thread. In this case, $10 have disappeared from the system after Alice and Bob make near-simultaneous transfers.
#+NAME:   tab:basic-data
| Time | Thread             | Command                   | Alice's $ | Bob's $ | Big problem? |
|------+--------------------+---------------------------+-----------+---------+--------------|
|    0 | Bob -($10)-> Alice | getBalance bob            |    100.00 |   50.00 | No           |
|    1 | Bob -($10)-> Alice | setBalance bob (50 - 10)  |    100.00 |   40.00 | Maybe...     |
|    2 | Alice -($20)-> Bob | getBalance alice          |    100.00 |   40.00 | Maybe...     |
|    3 | Alice -($20)-> Bob | setBalance alice (100-20) |     80.00 |   40.00 | Maybe...     |
|    4 | Alice -($20)-> Bob | getBalance bob            |     80.00 |   40.00 | Maybe...     |
|    5 | Alice -($20)-> Bob | setBalance bob (40+20)    |     80.00 |   60.00 | Maybe...     |
|    6 | Bob -($10)-> Alice | getBalance alice          |     80.00 |   60.00 | Maybe...     |
|    7 | Bob -($10)-> Alice | setBalance alice (80+10)  |     90.00 |   40.00 | Yes!         |

So functions that may be run in a concurrent context must somehow clamp the access to variables so that that threads don't make changes behind one another's backs. The basic tool for this is the /mutex/ [fn:: Mutex is short for Mutual exclusion], a `lock' that can be taken by at most one thread at a time. Mutexes are managed by the runtime system and are synchronized across all threads. It's up to the programmer's discretion how many she would like to create and which blocks of code she would like to wrap with them, and how tightly. But it turns out, there is no generally acceptable answer here either! We can wrap the entire $transfer$ function in a single mutex, but this means the entire program can only run a single transfer at a time; Bob and Alice are blocked from making their transfers while a completely unrelated transfer between Chris and Dean is going on. Alternatively, we could make a mutex for each account-holder in the bank, and in the process of transfering money between Alice and Bob, we take both mutexes in turn, perform the transfer, then return both mutexes. This can be made to work, but perhaps surprisngly, it is subject to a problem similar to that in the mutex-free case: the act of taking and releasign mutexes is prone to interaction effects. Alice transfering to Bob at nearly the same time that Bob transfers to Alice can cause one thread to take Alice's mutex just as the other take's Bob's, and then neither thread can make progress because each one is stuck waiting for the other to finish its transaction and release the complementary mutex. The topic is inherently difficult to understand, but the author is partly to blame for this too, in this case. For a more thorough treatment of this topic refer to Marlow's excellent Parallel and Concurrent Programming in Haskell [@marlow2012parallel]. The main point is, concurrency is often necessary to consider in programs that interact with the outside world, with inputs coming from multiple sources, and coping with it can be subtle and difficult.

